// Task-2-6-ru.c : Этот файл содержит функцию 'main'. 
// Выполнение программы начинается и заканчивается здесь.
#define _CRT_SECURE_NO_WARNINGS
#include <stdio.h>
#include <locale.h>
#include <stdlib.h>
#include <stdbool.h>

int main(int argc, char* argv[])
{
    unsigned int n; // число, "корень" которого надо найти.
    unsigned int m; // "корень" числа.
    // Установка русской локали для терминала Windows 11
    // 1-й способ. Выплнить внешнюю команду.
    system("chcp 65001 >nul");
    // 2 - й способ. Вызов библиотечной функции.
    setlocale(LC_ALL, "russian.65001"); 
    printf("Введите число: ");
    scanf("%u", &n);
    m = n;  // Начальное значение "корня" числа
    while (m > 9)  // Внешний цикл: повторять пока число не станет однозначным
    {
        unsigned int s = 0;  // Сумма цифр введённого числа
        while (m > 0)  // Внутренний цикл: повторять пока число больше нуля
        {
            s = s + m % 10;  // Вычислить сумму цифр числа.
            m = m / 10; // Число уменьшить в 10 раз.
        }
        m = s;  // Промежуточное значение "корня" числа
    }
    // Вывод на экран исходного числа и его "корня"
    printf("\"Корень\" числа %d  - %d\r\n", n, m);
    // Задержка вывода на экран до нажатия клавиши "Ввод"
    getchar();
    getc(stdin);
    return 0;
}

// Запуск программы: Ctrl + F5 или меню «Отладка» > «Запустить без отладки»
// Отладка программы: F5 или меню «Отладка» > «Запустить отладку»
// Советы по началу работы:
// 1. Используйте окно «Обозреватель решений» для добавления/управления файлами
// 2. Используйте окно «Обозреватель команд» для подключения к системе контроля версий
// 3. Используйте окно «Вывод», чтобы просмотреть результаты сборки и другие сообщения
// 4. Используйте окно «Список ошибок», чтобы просмотреть ошибки
// 5. Перейдите в меню «Проект» > «Добавить новый элемент», чтобы создать новые файлы кода, 
//    или в меню «Проект» > «Добавить существующий элемент», 
//    чтобы добавить существующие файлы кода в проект